<?php
if (!defined('IS_INITPHP')) exit('Access Denied!');
/*********************************************************************************
 * InitPHP 3.8.2 国产PHP开发框架   - 工具库-phpinfo
 *-------------------------------------------------------------------------------
 * 版权所有: CopyRight By initphp.com
 * 您可以自由使用该源码，但是在使用过程中，请保留作者信息。尊重他人劳动成果就是尊重自己
 *-------------------------------------------------------------------------------
 * Author:zhuli Dtime:2014-11-25
***********************************************************************************/
class phpinfoInit {
	
	/**
	 * 显示PHPINFO信息
	 * 使用方法：$this->getUtil('phpinfo')->get_phpinfo();
	 */
	public function get_phpinfo() {
		phpinfo();  
		exit;
	}
}